# Item Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UV..::..Item Property
UV Class See Also
---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double this[
	int idx
] { get; }
```

Visual Basic
---
```text
Public ReadOnly Default Property Item ( _
	idx As Integer _
) As Double
	Get
```

Visual C++
---
```text
public:
property double default[int idx] {
	double get (int idx);
}
```

# ### Parameters
idx
    Type: System..::..Int32
# See Also
UV Class
Autodesk.Revit.DB Namespace